/*
*******************************************************************************
*                     《手把手教你学51单片机(C语言版)》
* 文件名：main.c
* 描  述：第5章 例程代码
* 版本号：v1.0.0
* 备  注：点亮数码管
*******************************************************************************
*/
#include <reg52.h>

sbit  ADDR0 = P1^0;
sbit  ADDR1 = P1^1;
sbit  ADDR2 = P1^2;
sbit  ADDR3 = P1^3;
sbit ENLED = P1^4;

void main()
{
	//执行语句
	ENLED = 0;	//使能U3（74HC138）
	ADDR3 = 1;	//数码管DS1由LEDS0控制，所以LEDS06要为低电平来导通Q17三极管
	ADDR2 = 0;
	ADDR1 = 0;
	ADDR0 = 0;
	P0 = 0xF9;	//点亮数码管段b和c
	while(1);
}