/*
*******************************************************************************
*                     《手把手教你学51单片机(C语言版)》
* 文件名：main.c
* 描  述：第7章 例程代码
* 版本号：v1.0.0
* 备  注：点阵LED的一行
*******************************************************************************
*/
#include <reg52.h>

sbit ADDR0 = P1^0;
sbit ADDR1 = P1^1;
sbit ADDR2 = P1^2;
sbit ADDR3 = P1^3;
sbit ENLED = P1^4;

void main()
{
	ENLED = 0;	//使能U4的74HC138
	ADDR3 = 0;
	//点亮点阵的第二行盏灯
	ADDR2 = 0;	//使能三极管Q11
	ADDR1 = 0;
	ADDR0 = 1;
	P0 = 0x00;
	while(1);
}